{
    "jokes": [
        "Why did the tomato turn red? Because it saw the salad dressing!",
        "Why did the banana go to the doctor? Because it wasn't peeling well!",
        "Why did the chicken cross the playground? To get to the other slide!",
        "What did the grape say when it got stepped on all day? Nothing, it just let out a little wine.",
        "Why did the bread win the race? Because it was on a roll!",
        "Why did the cookie go to the doctor? Because it felt crummy!",
        "Why did the coffee file a police report? It got mugged!",
        "Why did the orange stop in the middle of the road? Because it ran out of juice!",
        "Why did the chef quit his job? He didn't have the thyme for it!",
        "Why don't scientists trust atoms? Because they make up everything!",
        "Why did the tomato turn red? Salad dressing!",
        "Why did the banana go to the doctor? He wasn't peeling well!",
        "What do you call fake spaghetti? An impasta!",
        "Why did the mushroom go to the party? He was a fungi to be with!",
        "What's a vampire's favorite fruit? A blood orange!",
        "Why don't eggs tell jokes? They'd crack each other up!",
        "Why did the cookie go to the doctor? He felt crummy!",
        "What's a penguin's favorite food? Ice-burgers!",
        "What do you call an alligator in a vest? An investigator!",
        "Why did the grape stop in the middle of the road? He ran out of juice!",
        "What do you call fake spaghetti? An impasta!",
        "What is a dog's favorite pizza? Pupperoni!",
        "Why did the tomato turn red? Because it saw the salad dressing!",
        "Why did the cookie go to the doctor? Because it felt crummy!",
        "Why did the banana go to the doctor? Because it wasn't peeling well!",
        "Why did the grape stop in the middle of the road? Because he ran out of juice!",
        "What's a vampire's favorite fruit? A blood orange!",
        "Why did the mushroom go to the party? Because he was a fungi to be with!",
        "What do you call an alligator in a vest? An investigator!",
        "Why don't eggs tell jokes? Because they'd crack each other up!"

    ]
}
